[Timeout] BlockStatement
e2e/page/inventarioPage.ts:17:28
     readonly campoSelecaoOrdencao: Locator;
     
    
-    constructor(page: Page){
-        this.page = page;
-        this.botaoAddCarrinhoProduto1 = page.locator('#add-to-cart-sauce-labs-backpack');
-        this.botaoAddCarrinhoProduto2 = page.locator('#add-to-cart-sauce-labs-bike-light');
-        this.contagemProdutoCarrinho = page.locator('.shopping_cart_badge');
-        this.botaoRemover = page.locator('#remove-sauce-labs-backpack')
-        this.botaoCarrinho = page.locator('.shopping_cart_link')
-        this.selecionarProduto1 = page.locator('#item_4_title_link')
-        this.campoSelecaoOrdencao = page.locator('.product_sort_container')
-      
-
-    }
+    constructor(page: Page){}
 
     async goto(){

[Timeout] BlockStatement
e2e/page/inventarioPage.ts:30:17
 
     }
 
-    async goto(){
-        await this.page.goto(URL);
-        await expect(this.page).toHaveURL(URL);
-
-    }
+    async goto(){}
 
     async validarContagemCarrinho(esperado: string){

[Timeout] BlockStatement
e2e/page/inventarioPage.ts:36:52
 
     }
 
-    async validarContagemCarrinho(esperado: string){
-        await expect(this.contagemProdutoCarrinho).toHaveText(esperado);
-    }
+    async validarContagemCarrinho(esperado: string){}
 
     async clicarBotaoAdicionarCarrinhoProduto1(){

[Timeout] BlockStatement
e2e/page/inventarioPage.ts:40:49
         await expect(this.contagemProdutoCarrinho).toHaveText(esperado);
     }
 
-    async clicarBotaoAdicionarCarrinhoProduto1(){
-        await this.botaoAddCarrinhoProduto1.click();
-    }
+    async clicarBotaoAdicionarCarrinhoProduto1(){}
 
     async clicarBotaoAdicionarCarrinhoProduto2(){

[Timeout] BlockStatement
e2e/page/inventarioPage.ts:44:49
         await this.botaoAddCarrinhoProduto1.click();
     }
 
-    async clicarBotaoAdicionarCarrinhoProduto2(){
-        await this.botaoAddCarrinhoProduto2.click();
-    }
+    async clicarBotaoAdicionarCarrinhoProduto2(){}
 
     async clicarBotaoRemoverProdutoCarrinho(){

[Timeout] BlockStatement
e2e/page/inventarioPage.ts:48:46
         await this.botaoAddCarrinhoProduto2.click();
     }
 
-    async clicarBotaoRemoverProdutoCarrinho(){
-        await this.botaoRemover.click();
-        await expect(this.contagemProdutoCarrinho).not.toBeVisible();
-    }
+    async clicarBotaoRemoverProdutoCarrinho(){}
 
     async clicarBotaoCarrinho(){

[Timeout] BlockStatement
e2e/page/inventarioPage.ts:53:32
         await expect(this.contagemProdutoCarrinho).not.toBeVisible();
     }
 
-    async clicarBotaoCarrinho(){
-        await this.botaoCarrinho.click();
-        await expect(this.page).toHaveURL(/.*cart.html/);
-    }
+    async clicarBotaoCarrinho(){}
 
     async clicarBotaoProduto1(){

[Timeout] Regex
e2e/page/inventarioPage.ts:55:43
 
     async clicarBotaoCarrinho(){
         await this.botaoCarrinho.click();
-        await expect(this.page).toHaveURL(/.*cart.html/);
+        await expect(this.page).toHaveURL(/.cart.html/);
     }
 

[Timeout] BlockStatement
e2e/page/inventarioPage.ts:58:32
         await expect(this.page).toHaveURL(/.*cart.html/);
     }
 
-    async clicarBotaoProduto1(){
-        await this.selecionarProduto1.click();
-        await expect(this.page).toHaveURL(/.*inventory-item\.html\?id=4/);
-
-        
-    }
+    async clicarBotaoProduto1(){}
 
     async selecionarOrdenacao(){

[Timeout] Regex
e2e/page/inventarioPage.ts:60:43
 
     async clicarBotaoProduto1(){
         await this.selecionarProduto1.click();
-        await expect(this.page).toHaveURL(/.*inventory-item\.html\?id=4/);
+        await expect(this.page).toHaveURL(/.inventory-item\.html\?id=4/);
 
         

[Timeout] BlockStatement
e2e/page/inventarioPage.ts:65:32
         
     }
 
-    async selecionarOrdenacao(){
-        await this.campoSelecaoOrdencao.click();
-        await this.campoSelecaoOrdencao.selectOption('lohi');
-        
-    }
+    async selecionarOrdenacao(){}
 
     async verificarOrdencacaoPrecoMenorParaMaior(){

[Timeout] StringLiteral
e2e/page/inventarioPage.ts:67:54
 
     async selecionarOrdenacao(){
         await this.campoSelecaoOrdencao.click();
-        await this.campoSelecaoOrdencao.selectOption('lohi');
+        await this.campoSelecaoOrdencao.selectOption("");
         
     }

[Timeout] BlockStatement
e2e/page/inventarioPage.ts:71:51
         
     }
 
-    async verificarOrdencacaoPrecoMenorParaMaior(){
-        const elementoPreco = await this.page.locator('.inventory_item_price').allInnerTexts();
-
-        const precoNumericos = elementoPreco.map(preco => parseFloat(preco.replace('$', '')))
-
-        const precoEsperado = [...precoNumericos].sort((a,b) => a - b)
-
-        expect(precoNumericos).toEqual(precoEsperado)
-        console.log('Valores convertidos em número:', precoNumericos);
-    }
+    async verificarOrdencacaoPrecoMenorParaMaior(){}
 
 

[Timeout] ArrowFunction
e2e/page/inventarioPage.ts:74:50
     async verificarOrdencacaoPrecoMenorParaMaior(){
         const elementoPreco = await this.page.locator('.inventory_item_price').allInnerTexts();
 
-        const precoNumericos = elementoPreco.map(preco => parseFloat(preco.replace('$', '')))
+        const precoNumericos = elementoPreco.map(() => undefined)
 
         const precoEsperado = [...precoNumericos].sort((a,b) => a - b)

[Timeout] StringLiteral
e2e/page/inventarioPage.ts:74:89
     async verificarOrdencacaoPrecoMenorParaMaior(){
         const elementoPreco = await this.page.locator('.inventory_item_price').allInnerTexts();
 
-        const precoNumericos = elementoPreco.map(preco => parseFloat(preco.replace('$', '')))
+        const precoNumericos = elementoPreco.map(preco => parseFloat(preco.replace('$', "Stryker was here!")))
 
         const precoEsperado = [...precoNumericos].sort((a,b) => a - b)

[Timeout] ArrowFunction
e2e/page/inventarioPage.ts:76:56
 
         const precoNumericos = elementoPreco.map(preco => parseFloat(preco.replace('$', '')))
 
-        const precoEsperado = [...precoNumericos].sort((a,b) => a - b)
+        const precoEsperado = [...precoNumericos].sort(() => undefined)
 
         expect(precoNumericos).toEqual(precoEsperado)

[Timeout] ArithmeticOperator
e2e/page/inventarioPage.ts:76:65
 
         const precoNumericos = elementoPreco.map(preco => parseFloat(preco.replace('$', '')))
 
-        const precoEsperado = [...precoNumericos].sort((a,b) => a - b)
+        const precoEsperado = [...precoNumericos].sort((a,b) => a + b)
 
         expect(precoNumericos).toEqual(precoEsperado)

[Timeout] StringLiteral
e2e/page/inventarioPage.ts:79:21
         const precoEsperado = [...precoNumericos].sort((a,b) => a - b)
 
         expect(precoNumericos).toEqual(precoEsperado)
-        console.log('Valores convertidos em número:', precoNumericos);
+        console.log("", precoNumericos);
     }
 
