[Timeout] BlockStatement
e2e/page/loginPage.ts:11:28
     readonly botaoLogin: Locator;
     readonly mensagemUsuarioSenhaInvalido: Locator;
 
-    constructor(page: Page){
-        this.page = page;
-        this.campoUsuario = page.locator('#user-name')
-        this.campoSenha = page.locator('#password')
-        this.botaoLogin = page.locator('#login-button')
-        this.mensagemUsuarioSenhaInvalido = page.locator('.error-message-container')
-
-    }
+    constructor(page: Page){}
 
     async goto(){

[Killed] StringLiteral
e2e/page/loginPage.ts:16:58
         this.campoUsuario = page.locator('#user-name')
         this.campoSenha = page.locator('#password')
         this.botaoLogin = page.locator('#login-button')
-        this.mensagemUsuarioSenhaInvalido = page.locator('.error-message-container')
+        this.mensagemUsuarioSenhaInvalido = page.locator("")
 
     }
killedBy: All tests
statusReason: Running 36 tests using 2 workers



[1/36] [chromium] › e2e\inventario.spec.ts:8:5 › CT01 - Clicar no botão "Add to cart" em um produto

[2/36] [chromium] › e2e\inventario.spec.ts:17:5 › CT02 - Clicar no botão "Remove" em um produto adicionado no carrinho

[Timeout] BlockStatement
e2e/page/loginPage.ts:20:17
 
     }
 
-    async goto(){
-        await this.page.goto(URL)
-        await expect(this.page).toHaveURL(URL)
-    }
+    async goto(){}
 
     async login(usuario: string, senha: string){

[Timeout] BlockStatement
e2e/page/loginPage.ts:25:48
         await expect(this.page).toHaveURL(URL)
     }
 
-    async login(usuario: string, senha: string){
-        await this.campoUsuario.fill(usuario);
-        await this.campoSenha.fill(senha);
-        await this.botaoLogin.click();
-    }
+    async login(usuario: string, senha: string){}
 
     async verificarMensagemLoginInvalido(mensagemEsperada: string) {

[Timeout] BlockStatement
e2e/page/loginPage.ts:31:68
         await this.botaoLogin.click();
     }
 
-    async verificarMensagemLoginInvalido(mensagemEsperada: string) {
-        // Verifica se o elemento está visível na tela
-        const locator = this.mensagemUsuarioSenhaInvalido;
-        await expect(locator).toBeVisible();
-        // Verifica se o texto do elemento é exatamente o esperado
-        await expect(locator).toHaveText(mensagemEsperada);
-        return  locator;
-    }
+    async verificarMensagemLoginInvalido(mensagemEsperada: string) {}
 
 
