[Timeout] BlockStatement
e2e/fixtures/baseTest.ts:9:41
 };
 
 export const test = base.extend<MinhaFixtures>({
-    loginPage: async ({ page }, use) => {
-        
-        const loginPage = new LoginPage(page);
-        await use(loginPage);
-    },
+    loginPage: async ({ page }, use) => {},
 });
 
