[Timeout] BlockStatement
e2e/page/loginPage.ts:31:68
         await this.botaoLogin.click();
     }
 
-    async verificarMensagemLoginInvalido(mensagemEsperada: string) {
-        // Verifica se o elemento está visível na tela
-        await expect(this.mensagemUsuarioSenhaInvalido).toBeVisible();
-        
-        // Verifica se o texto do elemento é exatamente o esperado
-        await expect(this.mensagemUsuarioSenhaInvalido).toHaveText(mensagemEsperada);
-    }
+    async verificarMensagemLoginInvalido(mensagemEsperada: string) {}
 
 
